; ModuleID = '__uClibc_main.os'
source_filename = "libc/misc/internals/__uClibc_main.c"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-pc-linux-gnu"

%struct.__uclibc_locale_struct.193 = type { i16*, i16*, i16*, [384 x i16], [384 x i16], [384 x i16], [14 x i8], [6 x i16], [6 x i8], i8, i8, [10 x i8], i8*, i8*, i8*, i8*, i8*, i16*, i8*, i8*, i16*, i8*, i8*, i16*, i32, i32, i32, i32, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__collate_t.192 }
%struct.__collate_t.192 = type { i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16*, i16 }
%struct.__STDIO_FILE_STRUCT.560 = type { i16, [2 x i8], i32, i8*, i8*, i8*, i8*, i8*, i8*, %struct.__STDIO_FILE_STRUCT.560*, [2 x i32], %struct.__mbstate_t.559, i8* }
%struct.__mbstate_t.559 = type { i32, i32 }
%struct.exe_file_t = type { i32, i32, i64, %struct.exe_disk_file_t* }
%struct.exe_disk_file_t = type { i32, i8*, %struct.stat64* }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "__libc_stack_end", scope: !2, file: !3, line: 52, type: !6, isLocal: false, isDefinition: true)
!2 = distinct !DICompileUnit(language: DW_LANG_C99, file: !3, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !5, globals: !26, splitDebugInlining: false, nameTableKind: None)
!3 = !DIFile(filename: "libc/misc/internals/__uClibc_main.c", directory: "/home/vondrp/klee/klee-uclibc")
!4 = !{}
!5 = !{!6, !7, !9, !11, !23, !25}
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: null, size: 64)
!7 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !8, size: 64)
!8 = !DIBasicType(name: "char", size: 8, encoding: DW_ATE_signed_char)
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DIBasicType(name: "long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!11 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !12, size: 64)
!12 = !DIDerivedType(tag: DW_TAG_typedef, name: "Elf64_auxv_t", file: !13, line: 1036, baseType: !14)
!13 = !DIFile(filename: "./include/elf.h", directory: "/home/vondrp/klee/klee-uclibc")
!14 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !13, line: 1026, size: 128, elements: !15)
!15 = !{!16, !19}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "a_type", scope: !14, file: !13, line: 1028, baseType: !17, size: 64)
!17 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint64_t", file: !18, line: 58, baseType: !10)
!18 = !DIFile(filename: "./include/stdint.h", directory: "/home/vondrp/klee/klee-uclibc")
!19 = !DIDerivedType(tag: DW_TAG_member, name: "a_un", scope: !14, file: !13, line: 1035, baseType: !20, size: 64, offset: 64)
!20 = distinct !DICompositeType(tag: DW_TAG_union_type, scope: !14, file: !13, line: 1029, size: 64, elements: !21)
!21 = !{!22}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "a_val", scope: !20, file: !13, line: 1031, baseType: !17, size: 64)
!23 = !DIDerivedType(tag: DW_TAG_typedef, name: "size_t", file: !24, line: 46, baseType: !10)
!24 = !DIFile(filename: "/usr/lib/llvm-13/lib/clang/13.0.1/include/stddef.h", directory: "")
!25 = !DIBasicType(name: "long long unsigned int", size: 64, encoding: DW_ATE_unsigned)
!26 = !{!0, !27, !31, !33, !35, !38, !40, !46, !49}
!27 = !DIGlobalVariableExpression(var: !28, expr: !DIExpression())
!28 = distinct !DIGlobalVariable(name: "__uclibc_progname", scope: !2, file: !3, line: 110, type: !29, isLocal: false, isDefinition: true)
!29 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !30, size: 64)
!30 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !8)
!31 = !DIGlobalVariableExpression(var: !32, expr: !DIExpression())
!32 = distinct !DIGlobalVariable(name: "program_invocation_short_name", scope: !2, file: !3, line: 112, type: !29, isLocal: false, isDefinition: true)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "program_invocation_name", scope: !2, file: !3, line: 113, type: !29, isLocal: false, isDefinition: true)
!35 = !DIGlobalVariableExpression(var: !36, expr: !DIExpression())
!36 = distinct !DIGlobalVariable(name: "__environ", scope: !2, file: !3, line: 125, type: !37, isLocal: false, isDefinition: true)
!37 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !7, size: 64)
!38 = !DIGlobalVariableExpression(var: !39, expr: !DIExpression())
!39 = distinct !DIGlobalVariable(name: "__pagesize", scope: !2, file: !3, line: 129, type: !23, isLocal: false, isDefinition: true)
!40 = !DIGlobalVariableExpression(var: !41, expr: !DIExpression())
!41 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !42, file: !3, line: 189, type: !45, isLocal: true, isDefinition: true)
!42 = distinct !DISubprogram(name: "__uClibc_init", scope: !3, file: !3, line: 187, type: !43, scopeLine: 188, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !2, retainedNodes: !4)
!43 = !DISubroutineType(types: !44)
!44 = !{null}
!45 = !DIBasicType(name: "int", size: 32, encoding: DW_ATE_signed)
!46 = !DIGlobalVariableExpression(var: !47, expr: !DIExpression())
!47 = distinct !DIGlobalVariable(name: "__app_fini", scope: !2, file: !3, line: 244, type: !48, isLocal: false, isDefinition: true)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !43, size: 64)
!49 = !DIGlobalVariableExpression(var: !50, expr: !DIExpression())
!50 = distinct !DIGlobalVariable(name: "__rtld_fini", scope: !2, file: !3, line: 247, type: !48, isLocal: false, isDefinition: true)
!51 = !DIGlobalVariableExpression(var: !52, expr: !DIExpression())
!52 = distinct !DIGlobalVariable(name: "n_calls", scope: !53, file: !54, line: 397, type: !45, isLocal: true, isDefinition: true)
!53 = distinct !DISubprogram(name: "write", scope: !54, file: !54, line: 396, type: !55, scopeLine: 396, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!54 = !DIFile(filename: "runtime/POSIX/fd.c", directory: "/home/vondrp/klee/klee")
!55 = !DISubroutineType(types: !56)
!56 = !{!57, !45, !62, !23}
!57 = !DIDerivedType(tag: DW_TAG_typedef, name: "ssize_t", file: !58, line: 108, baseType: !59)
!58 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/types.h", directory: "")
!59 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ssize_t", file: !60, line: 194, baseType: !61)
!60 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types.h", directory: "")
!61 = !DIBasicType(name: "long int", size: 64, encoding: DW_ATE_signed)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !63, size: 64)
!63 = !DIDerivedType(tag: DW_TAG_const_type, baseType: null)
!64 = distinct !DICompileUnit(language: DW_LANG_C89, file: !65, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !66, retainedTypes: !87, globals: !143, splitDebugInlining: false, nameTableKind: None)
!65 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/fd.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!66 = !{!67, !75}
!67 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !68, line: 58, baseType: !69, size: 32, elements: !70)
!68 = !DIFile(filename: "runtime/POSIX/fd.h", directory: "/home/vondrp/klee/klee")
!69 = !DIBasicType(name: "unsigned int", size: 32, encoding: DW_ATE_unsigned)
!70 = !{!71, !72, !73, !74}
!71 = !DIEnumerator(name: "eOpen", value: 1)
!72 = !DIEnumerator(name: "eCloseOnExec", value: 2)
!73 = !DIEnumerator(name: "eReadable", value: 4)
!74 = !DIEnumerator(name: "eWriteable", value: 8)
!75 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !76, line: 97, baseType: !69, size: 32, elements: !77)
!76 = !DIFile(filename: "/usr/include/dirent.h", directory: "")
!77 = !{!78, !79, !80, !81, !82, !83, !84, !85, !86}
!78 = !DIEnumerator(name: "DT_UNKNOWN", value: 0)
!79 = !DIEnumerator(name: "DT_FIFO", value: 1)
!80 = !DIEnumerator(name: "DT_CHR", value: 2)
!81 = !DIEnumerator(name: "DT_DIR", value: 4)
!82 = !DIEnumerator(name: "DT_BLK", value: 6)
!83 = !DIEnumerator(name: "DT_REG", value: 8)
!84 = !DIEnumerator(name: "DT_LNK", value: 10)
!85 = !DIEnumerator(name: "DT_SOCK", value: 12)
!86 = !DIEnumerator(name: "DT_WHT", value: 14)
!87 = !{!61, !6, !88, !10, !90, !7, !105, !45, !8}
!88 = !DIDerivedType(tag: DW_TAG_typedef, name: "off64_t", file: !58, line: 92, baseType: !89)
!89 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off64_t", file: !60, line: 153, baseType: !61)
!90 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !91, size: 64)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !92, line: 37, size: 2240, elements: !93)
!92 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/dirent.h", directory: "")
!93 = !{!94, !96, !97, !99, !101}
!94 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !91, file: !92, line: 39, baseType: !95, size: 64)
!95 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino64_t", file: !60, line: 149, baseType: !10)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !91, file: !92, line: 40, baseType: !89, size: 64, offset: 64)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !91, file: !92, line: 41, baseType: !98, size: 16, offset: 128)
!98 = !DIBasicType(name: "unsigned short", size: 16, encoding: DW_ATE_unsigned)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !91, file: !92, line: 42, baseType: !100, size: 8, offset: 144)
!100 = !DIBasicType(name: "unsigned char", size: 8, encoding: DW_ATE_unsigned_char)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !91, file: !92, line: 43, baseType: !102, size: 2048, offset: 152)
!102 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 2048, elements: !103)
!103 = !{!104}
!104 = !DISubrange(count: 256)
!105 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !106, size: 64)
!106 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat", file: !107, line: 26, size: 1152, elements: !108)
!107 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/struct_stat.h", directory: "")
!108 = !{!109, !111, !113, !115, !117, !119, !121, !122, !123, !125, !127, !129, !137, !138, !139}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !106, file: !107, line: 31, baseType: !110, size: 64)
!110 = !DIDerivedType(tag: DW_TAG_typedef, name: "__dev_t", file: !60, line: 145, baseType: !10)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !106, file: !107, line: 36, baseType: !112, size: 64, offset: 64)
!112 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ino_t", file: !60, line: 148, baseType: !10)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !106, file: !107, line: 44, baseType: !114, size: 64, offset: 128)
!114 = !DIDerivedType(tag: DW_TAG_typedef, name: "__nlink_t", file: !60, line: 151, baseType: !10)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !106, file: !107, line: 45, baseType: !116, size: 32, offset: 192)
!116 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mode_t", file: !60, line: 150, baseType: !69)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !106, file: !107, line: 47, baseType: !118, size: 32, offset: 224)
!118 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uid_t", file: !60, line: 146, baseType: !69)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !106, file: !107, line: 48, baseType: !120, size: 32, offset: 256)
!120 = !DIDerivedType(tag: DW_TAG_typedef, name: "__gid_t", file: !60, line: 147, baseType: !69)
!121 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !106, file: !107, line: 50, baseType: !45, size: 32, offset: 288)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !106, file: !107, line: 52, baseType: !110, size: 64, offset: 320)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !106, file: !107, line: 57, baseType: !124, size: 64, offset: 384)
!124 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !60, line: 152, baseType: !61)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !106, file: !107, line: 61, baseType: !126, size: 64, offset: 448)
!126 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blksize_t", file: !60, line: 175, baseType: !61)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !106, file: !107, line: 63, baseType: !128, size: 64, offset: 512)
!128 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt_t", file: !60, line: 180, baseType: !61)
!129 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !106, file: !107, line: 74, baseType: !130, size: 128, offset: 576)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !131, line: 11, size: 128, elements: !132)
!131 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/bits/types/struct_timespec.h", directory: "")
!132 = !{!133, !135}
!133 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !130, file: !131, line: 16, baseType: !134, size: 64)
!134 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !60, line: 160, baseType: !61)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !130, file: !131, line: 21, baseType: !136, size: 64, offset: 64)
!136 = !DIDerivedType(tag: DW_TAG_typedef, name: "__syscall_slong_t", file: !60, line: 197, baseType: !61)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !106, file: !107, line: 75, baseType: !130, size: 128, offset: 704)
!138 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !106, file: !107, line: 76, baseType: !130, size: 128, offset: 832)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !106, file: !107, line: 89, baseType: !140, size: 192, offset: 960)
!140 = !DICompositeType(tag: DW_TAG_array_type, baseType: !136, size: 192, elements: !141)
!141 = !{!142}
!142 = !DISubrange(count: 3)
!143 = !{!144, !149, !51, !154, !160, !165, !170}
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "n_calls", scope: !146, file: !54, line: 299, type: !45, isLocal: true, isDefinition: true)
!146 = distinct !DISubprogram(name: "close", scope: !54, file: !54, line: 298, type: !147, scopeLine: 298, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!147 = !DISubroutineType(types: !148)
!148 = !{!45, !45}
!149 = !DIGlobalVariableExpression(var: !150, expr: !DIExpression())
!150 = distinct !DIGlobalVariable(name: "n_calls", scope: !151, file: !54, line: 331, type: !45, isLocal: true, isDefinition: true)
!151 = distinct !DISubprogram(name: "read", scope: !54, file: !54, line: 330, type: !152, scopeLine: 330, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!152 = !DISubroutineType(types: !153)
!153 = !{!57, !45, !6, !23}
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "n_calls", scope: !156, file: !54, line: 633, type: !45, isLocal: true, isDefinition: true)
!156 = distinct !DISubprogram(name: "chmod", scope: !54, file: !54, line: 632, type: !157, scopeLine: 632, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!157 = !DISubroutineType(types: !158)
!158 = !{!45, !29, !159}
!159 = !DIDerivedType(tag: DW_TAG_typedef, name: "mode_t", file: !58, line: 69, baseType: !116)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "n_calls", scope: !162, file: !54, line: 652, type: !45, isLocal: true, isDefinition: true)
!162 = distinct !DISubprogram(name: "fchmod", scope: !54, file: !54, line: 651, type: !163, scopeLine: 651, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!163 = !DISubroutineType(types: !164)
!164 = !{!45, !45, !159}
!165 = !DIGlobalVariableExpression(var: !166, expr: !DIExpression())
!166 = distinct !DIGlobalVariable(name: "n_calls", scope: !167, file: !54, line: 738, type: !45, isLocal: true, isDefinition: true)
!167 = distinct !DISubprogram(name: "__fd_ftruncate", scope: !54, file: !54, line: 737, type: !168, scopeLine: 737, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!168 = !DISubroutineType(types: !169)
!169 = !{!45, !45, !88}
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "n_calls", scope: !172, file: !54, line: 1332, type: !45, isLocal: true, isDefinition: true)
!172 = distinct !DISubprogram(name: "getcwd", scope: !54, file: !54, line: 1331, type: !173, scopeLine: 1331, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !64, retainedNodes: !4)
!173 = !DISubroutineType(types: !174)
!174 = !{!7, !7, !23}
!175 = !DIGlobalVariableExpression(var: !176, expr: !DIExpression())
!176 = distinct !DIGlobalVariable(name: "__global_locale_data", scope: !177, file: !212, line: 375, type: !451, isLocal: false, isDefinition: true)
!177 = distinct !DICompileUnit(language: DW_LANG_C99, file: !178, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !179, retainedTypes: !201, globals: !254, splitDebugInlining: false, nameTableKind: None)
!178 = !DIFile(filename: "libc/misc/locale/_locale_init.c", directory: "/home/vondrp/klee/klee-uclibc")
!179 = !{!180, !186}
!180 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !181, line: 90, baseType: !69, size: 32, elements: !182)
!181 = !DIFile(filename: "./include/bits/uClibc_locale.h", directory: "/home/vondrp/klee/klee-uclibc")
!182 = !{!183, !184, !185}
!183 = !DIEnumerator(name: "__ctype_encoding_7_bit", value: 0)
!184 = !DIEnumerator(name: "__ctype_encoding_utf8", value: 1)
!185 = !DIEnumerator(name: "__ctype_encoding_8_bit", value: 2)
!186 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !187, line: 48, baseType: !69, size: 32, elements: !188)
!187 = !DIFile(filename: "./include/ctype.h", directory: "/home/vondrp/klee/klee-uclibc")
!188 = !{!189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200}
!189 = !DIEnumerator(name: "_ISupper", value: 256)
!190 = !DIEnumerator(name: "_ISlower", value: 512)
!191 = !DIEnumerator(name: "_ISalpha", value: 1024)
!192 = !DIEnumerator(name: "_ISdigit", value: 2048)
!193 = !DIEnumerator(name: "_ISxdigit", value: 4096)
!194 = !DIEnumerator(name: "_ISspace", value: 8192)
!195 = !DIEnumerator(name: "_ISprint", value: 16384)
!196 = !DIEnumerator(name: "_ISgraph", value: 32768)
!197 = !DIEnumerator(name: "_ISblank", value: 1)
!198 = !DIEnumerator(name: "_IScntrl", value: 2)
!199 = !DIEnumerator(name: "_ISpunct", value: 4)
!200 = !DIEnumerator(name: "_ISalnum", value: 8)
!201 = !{!45, !202, !7, !203, !205, !208, !100, !209, !210, !223, !231, !10}
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !29, size: 64)
!203 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !204, size: 64)
!204 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !100)
!205 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !206, size: 64)
!206 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !207)
!207 = !DIDerivedType(tag: DW_TAG_typedef, name: "uint16_t", file: !18, line: 52, baseType: !98)
!208 = !DIBasicType(name: "signed char", size: 8, encoding: DW_ATE_signed_char)
!209 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !100, size: 64)
!210 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !211, size: 64)
!211 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_header_t", file: !212, line: 400, baseType: !213)
!212 = !DIFile(filename: "libc/misc/locale/locale.c", directory: "/home/vondrp/klee/klee-uclibc")
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 390, size: 128, elements: !214)
!214 = !{!215, !216, !217, !218, !219, !220, !221, !222}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "num_base", scope: !213, file: !212, line: 391, baseType: !207, size: 16)
!216 = !DIDerivedType(tag: DW_TAG_member, name: "num_der", scope: !213, file: !212, line: 392, baseType: !207, size: 16, offset: 16)
!217 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !213, file: !212, line: 393, baseType: !207, size: 16, offset: 32)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "num_index2weight", scope: !213, file: !212, line: 394, baseType: !207, size: 16, offset: 48)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "num_weightstr", scope: !213, file: !212, line: 396, baseType: !207, size: 16, offset: 64)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "num_multistart", scope: !213, file: !212, line: 397, baseType: !207, size: 16, offset: 80)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "num_override", scope: !213, file: !212, line: 398, baseType: !207, size: 16, offset: 96)
!222 = !DIDerivedType(tag: DW_TAG_member, name: "num_ruletable", scope: !213, file: !212, line: 399, baseType: !207, size: 16, offset: 112)
!223 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !224, size: 64)
!224 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_der_t", file: !212, line: 430, baseType: !225)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 425, size: 64, elements: !226)
!226 = !{!227, !228, !229, !230}
!227 = !DIDerivedType(tag: DW_TAG_member, name: "base_idx", scope: !225, file: !212, line: 426, baseType: !207, size: 16)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !225, file: !212, line: 427, baseType: !207, size: 16, offset: 16)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_offset", scope: !225, file: !212, line: 428, baseType: !207, size: 16, offset: 32)
!230 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !225, file: !212, line: 429, baseType: !207, size: 16, offset: 48)
!231 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !232, size: 64)
!232 = !DIDerivedType(tag: DW_TAG_typedef, name: "coldata_base_t", file: !212, line: 423, baseType: !233)
!233 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !212, line: 402, size: 304, elements: !234)
!234 = !{!235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !233, file: !212, line: 403, baseType: !207, size: 16)
!236 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !233, file: !212, line: 404, baseType: !207, size: 16, offset: 16)
!237 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !233, file: !212, line: 405, baseType: !207, size: 16, offset: 32)
!238 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !233, file: !212, line: 406, baseType: !207, size: 16, offset: 48)
!239 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !233, file: !212, line: 407, baseType: !207, size: 16, offset: 64)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !233, file: !212, line: 408, baseType: !207, size: 16, offset: 80)
!241 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !233, file: !212, line: 409, baseType: !207, size: 16, offset: 96)
!242 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !233, file: !212, line: 410, baseType: !207, size: 16, offset: 112)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !233, file: !212, line: 411, baseType: !207, size: 16, offset: 128)
!244 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !233, file: !212, line: 412, baseType: !207, size: 16, offset: 144)
!245 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !233, file: !212, line: 413, baseType: !207, size: 16, offset: 160)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !233, file: !212, line: 414, baseType: !207, size: 16, offset: 176)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !233, file: !212, line: 415, baseType: !207, size: 16, offset: 192)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !233, file: !212, line: 416, baseType: !207, size: 16, offset: 208)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_offset", scope: !233, file: !212, line: 418, baseType: !207, size: 16, offset: 224)
!250 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_offset", scope: !233, file: !212, line: 419, baseType: !207, size: 16, offset: 240)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_offset", scope: !233, file: !212, line: 420, baseType: !207, size: 16, offset: 256)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_low", scope: !233, file: !212, line: 421, baseType: !207, size: 16, offset: 272)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_offset_hi", scope: !233, file: !212, line: 422, baseType: !207, size: 16, offset: 288)
!254 = !{!255, !439, !175, !441, !444, !446}
!255 = !DIGlobalVariableExpression(var: !256, expr: !DIExpression())
!256 = distinct !DIGlobalVariable(name: "__global_locale", scope: !177, file: !212, line: 377, type: !257, isLocal: false, isDefinition: true)
!257 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_t", file: !181, line: 330, baseType: !258)
!258 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !259, size: 64)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__uclibc_locale_struct", file: !181, line: 154, size: 26560, elements: !260)
!260 = !{!261, !268, !274, !275, !279, !281, !282, !286, !290, !292, !293, !294, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !313, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337, !338, !339, !340, !341, !342, !343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406, !407, !408}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b", scope: !259, file: !181, line: 156, baseType: !262, size: 64)
!262 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !263, size: 64)
!263 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !264)
!264 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_mask_t", file: !265, line: 38, baseType: !266)
!265 = !DIFile(filename: "./include/bits/uClibc_touplow.h", directory: "/home/vondrp/klee/klee-uclibc")
!266 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uint16_t", file: !267, line: 44, baseType: !98)
!267 = !DIFile(filename: "./include/bits/types.h", directory: "/home/vondrp/klee/klee-uclibc")
!268 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower", scope: !259, file: !181, line: 157, baseType: !269, size: 64, offset: 64)
!269 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !270, size: 64)
!270 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !271)
!271 = !DIDerivedType(tag: DW_TAG_typedef, name: "__ctype_touplow_t", file: !265, line: 42, baseType: !272)
!272 = !DIDerivedType(tag: DW_TAG_typedef, name: "__int16_t", file: !267, line: 43, baseType: !273)
!273 = !DIBasicType(name: "short", size: 16, encoding: DW_ATE_signed)
!274 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper", scope: !259, file: !181, line: 158, baseType: !269, size: 64, offset: 128)
!275 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_b_data", scope: !259, file: !181, line: 162, baseType: !276, size: 6144, offset: 192)
!276 = !DICompositeType(tag: DW_TAG_array_type, baseType: !264, size: 6144, elements: !277)
!277 = !{!278}
!278 = !DISubrange(count: 384)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_tolower_data", scope: !259, file: !181, line: 163, baseType: !280, size: 6144, offset: 6336)
!280 = !DICompositeType(tag: DW_TAG_array_type, baseType: !271, size: 6144, elements: !277)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__ctype_toupper_data", scope: !259, file: !181, line: 164, baseType: !280, size: 6144, offset: 12480)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "cur_locale", scope: !259, file: !181, line: 168, baseType: !283, size: 112, offset: 18624)
!283 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 112, elements: !284)
!284 = !{!285}
!285 = !DISubrange(count: 14)
!286 = !DIDerivedType(tag: DW_TAG_member, name: "category_offsets", scope: !259, file: !181, line: 174, baseType: !287, size: 96, offset: 18736)
!287 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 96, elements: !288)
!288 = !{!289}
!289 = !DISubrange(count: 6)
!290 = !DIDerivedType(tag: DW_TAG_member, name: "category_item_count", scope: !259, file: !181, line: 175, baseType: !291, size: 48, offset: 18832)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 48, elements: !288)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "encoding", scope: !259, file: !181, line: 178, baseType: !100, size: 8, offset: 18880)
!293 = !DIDerivedType(tag: DW_TAG_member, name: "mb_cur_max", scope: !259, file: !181, line: 179, baseType: !100, size: 8, offset: 18888)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit_length", scope: !259, file: !181, line: 180, baseType: !295, size: 80, offset: 18896)
!295 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 80, elements: !296)
!296 = !{!297}
!297 = !DISubrange(count: 10)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !259, file: !181, line: 183, baseType: !203, size: 64, offset: 19008)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !259, file: !181, line: 184, baseType: !203, size: 64, offset: 19072)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !259, file: !181, line: 185, baseType: !203, size: 64, offset: 19136)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !259, file: !181, line: 186, baseType: !203, size: 64, offset: 19200)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !259, file: !181, line: 188, baseType: !203, size: 64, offset: 19264)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !259, file: !181, line: 189, baseType: !205, size: 64, offset: 19328)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !259, file: !181, line: 190, baseType: !203, size: 64, offset: 19392)
!305 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !259, file: !181, line: 191, baseType: !203, size: 64, offset: 19456)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "code2flag", scope: !259, file: !181, line: 197, baseType: !205, size: 64, offset: 19520)
!307 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !259, file: !181, line: 199, baseType: !203, size: 64, offset: 19584)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !259, file: !181, line: 200, baseType: !203, size: 64, offset: 19648)
!309 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !259, file: !181, line: 202, baseType: !310, size: 64, offset: 19712)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64)
!311 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !312)
!312 = !DIDerivedType(tag: DW_TAG_typedef, name: "int16_t", file: !18, line: 40, baseType: !273)
!313 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_wc", scope: !259, file: !181, line: 205, baseType: !314, size: 32, offset: 19776)
!314 = !DIDerivedType(tag: DW_TAG_typedef, name: "wchar_t", file: !24, line: 74, baseType: !45)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_wc", scope: !259, file: !181, line: 206, baseType: !314, size: 32, offset: 19808)
!316 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point_len", scope: !259, file: !181, line: 207, baseType: !45, size: 32, offset: 19840)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep_len", scope: !259, file: !181, line: 208, baseType: !45, size: 32, offset: 19872)
!318 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit0_mb", scope: !259, file: !181, line: 213, baseType: !29, size: 64, offset: 19904)
!319 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit1_mb", scope: !259, file: !181, line: 214, baseType: !29, size: 64, offset: 19968)
!320 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit2_mb", scope: !259, file: !181, line: 215, baseType: !29, size: 64, offset: 20032)
!321 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit3_mb", scope: !259, file: !181, line: 216, baseType: !29, size: 64, offset: 20096)
!322 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit4_mb", scope: !259, file: !181, line: 217, baseType: !29, size: 64, offset: 20160)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit5_mb", scope: !259, file: !181, line: 218, baseType: !29, size: 64, offset: 20224)
!324 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit6_mb", scope: !259, file: !181, line: 219, baseType: !29, size: 64, offset: 20288)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit7_mb", scope: !259, file: !181, line: 220, baseType: !29, size: 64, offset: 20352)
!326 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit8_mb", scope: !259, file: !181, line: 221, baseType: !29, size: 64, offset: 20416)
!327 = !DIDerivedType(tag: DW_TAG_member, name: "outdigit9_mb", scope: !259, file: !181, line: 222, baseType: !29, size: 64, offset: 20480)
!328 = !DIDerivedType(tag: DW_TAG_member, name: "codeset", scope: !259, file: !181, line: 223, baseType: !29, size: 64, offset: 20544)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !259, file: !181, line: 226, baseType: !29, size: 64, offset: 20608)
!330 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !259, file: !181, line: 227, baseType: !29, size: 64, offset: 20672)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !259, file: !181, line: 228, baseType: !29, size: 64, offset: 20736)
!332 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !259, file: !181, line: 231, baseType: !29, size: 64, offset: 20800)
!333 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !259, file: !181, line: 232, baseType: !29, size: 64, offset: 20864)
!334 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !259, file: !181, line: 233, baseType: !29, size: 64, offset: 20928)
!335 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !259, file: !181, line: 234, baseType: !29, size: 64, offset: 20992)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !259, file: !181, line: 235, baseType: !29, size: 64, offset: 21056)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !259, file: !181, line: 236, baseType: !29, size: 64, offset: 21120)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !259, file: !181, line: 237, baseType: !29, size: 64, offset: 21184)
!339 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !259, file: !181, line: 238, baseType: !29, size: 64, offset: 21248)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !259, file: !181, line: 239, baseType: !29, size: 64, offset: 21312)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !259, file: !181, line: 240, baseType: !29, size: 64, offset: 21376)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !259, file: !181, line: 241, baseType: !29, size: 64, offset: 21440)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !259, file: !181, line: 242, baseType: !29, size: 64, offset: 21504)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !259, file: !181, line: 243, baseType: !29, size: 64, offset: 21568)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !259, file: !181, line: 244, baseType: !29, size: 64, offset: 21632)
!346 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !259, file: !181, line: 245, baseType: !29, size: 64, offset: 21696)
!347 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !259, file: !181, line: 246, baseType: !29, size: 64, offset: 21760)
!348 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !259, file: !181, line: 247, baseType: !29, size: 64, offset: 21824)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !259, file: !181, line: 248, baseType: !29, size: 64, offset: 21888)
!350 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !259, file: !181, line: 249, baseType: !29, size: 64, offset: 21952)
!351 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !259, file: !181, line: 250, baseType: !29, size: 64, offset: 22016)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !259, file: !181, line: 251, baseType: !29, size: 64, offset: 22080)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "crncystr", scope: !259, file: !181, line: 253, baseType: !29, size: 64, offset: 22144)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "abday_1", scope: !259, file: !181, line: 256, baseType: !29, size: 64, offset: 22208)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "abday_2", scope: !259, file: !181, line: 257, baseType: !29, size: 64, offset: 22272)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "abday_3", scope: !259, file: !181, line: 258, baseType: !29, size: 64, offset: 22336)
!357 = !DIDerivedType(tag: DW_TAG_member, name: "abday_4", scope: !259, file: !181, line: 259, baseType: !29, size: 64, offset: 22400)
!358 = !DIDerivedType(tag: DW_TAG_member, name: "abday_5", scope: !259, file: !181, line: 260, baseType: !29, size: 64, offset: 22464)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "abday_6", scope: !259, file: !181, line: 261, baseType: !29, size: 64, offset: 22528)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "abday_7", scope: !259, file: !181, line: 262, baseType: !29, size: 64, offset: 22592)
!361 = !DIDerivedType(tag: DW_TAG_member, name: "day_1", scope: !259, file: !181, line: 264, baseType: !29, size: 64, offset: 22656)
!362 = !DIDerivedType(tag: DW_TAG_member, name: "day_2", scope: !259, file: !181, line: 265, baseType: !29, size: 64, offset: 22720)
!363 = !DIDerivedType(tag: DW_TAG_member, name: "day_3", scope: !259, file: !181, line: 266, baseType: !29, size: 64, offset: 22784)
!364 = !DIDerivedType(tag: DW_TAG_member, name: "day_4", scope: !259, file: !181, line: 267, baseType: !29, size: 64, offset: 22848)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "day_5", scope: !259, file: !181, line: 268, baseType: !29, size: 64, offset: 22912)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "day_6", scope: !259, file: !181, line: 269, baseType: !29, size: 64, offset: 22976)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "day_7", scope: !259, file: !181, line: 270, baseType: !29, size: 64, offset: 23040)
!368 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_1", scope: !259, file: !181, line: 272, baseType: !29, size: 64, offset: 23104)
!369 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_2", scope: !259, file: !181, line: 273, baseType: !29, size: 64, offset: 23168)
!370 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_3", scope: !259, file: !181, line: 274, baseType: !29, size: 64, offset: 23232)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_4", scope: !259, file: !181, line: 275, baseType: !29, size: 64, offset: 23296)
!372 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_5", scope: !259, file: !181, line: 276, baseType: !29, size: 64, offset: 23360)
!373 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_6", scope: !259, file: !181, line: 277, baseType: !29, size: 64, offset: 23424)
!374 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_7", scope: !259, file: !181, line: 278, baseType: !29, size: 64, offset: 23488)
!375 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_8", scope: !259, file: !181, line: 279, baseType: !29, size: 64, offset: 23552)
!376 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_9", scope: !259, file: !181, line: 280, baseType: !29, size: 64, offset: 23616)
!377 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_10", scope: !259, file: !181, line: 281, baseType: !29, size: 64, offset: 23680)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_11", scope: !259, file: !181, line: 282, baseType: !29, size: 64, offset: 23744)
!379 = !DIDerivedType(tag: DW_TAG_member, name: "abmon_12", scope: !259, file: !181, line: 283, baseType: !29, size: 64, offset: 23808)
!380 = !DIDerivedType(tag: DW_TAG_member, name: "mon_1", scope: !259, file: !181, line: 285, baseType: !29, size: 64, offset: 23872)
!381 = !DIDerivedType(tag: DW_TAG_member, name: "mon_2", scope: !259, file: !181, line: 286, baseType: !29, size: 64, offset: 23936)
!382 = !DIDerivedType(tag: DW_TAG_member, name: "mon_3", scope: !259, file: !181, line: 287, baseType: !29, size: 64, offset: 24000)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "mon_4", scope: !259, file: !181, line: 288, baseType: !29, size: 64, offset: 24064)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "mon_5", scope: !259, file: !181, line: 289, baseType: !29, size: 64, offset: 24128)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "mon_6", scope: !259, file: !181, line: 290, baseType: !29, size: 64, offset: 24192)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "mon_7", scope: !259, file: !181, line: 291, baseType: !29, size: 64, offset: 24256)
!387 = !DIDerivedType(tag: DW_TAG_member, name: "mon_8", scope: !259, file: !181, line: 292, baseType: !29, size: 64, offset: 24320)
!388 = !DIDerivedType(tag: DW_TAG_member, name: "mon_9", scope: !259, file: !181, line: 293, baseType: !29, size: 64, offset: 24384)
!389 = !DIDerivedType(tag: DW_TAG_member, name: "mon_10", scope: !259, file: !181, line: 294, baseType: !29, size: 64, offset: 24448)
!390 = !DIDerivedType(tag: DW_TAG_member, name: "mon_11", scope: !259, file: !181, line: 295, baseType: !29, size: 64, offset: 24512)
!391 = !DIDerivedType(tag: DW_TAG_member, name: "mon_12", scope: !259, file: !181, line: 296, baseType: !29, size: 64, offset: 24576)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "am_str", scope: !259, file: !181, line: 298, baseType: !29, size: 64, offset: 24640)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "pm_str", scope: !259, file: !181, line: 299, baseType: !29, size: 64, offset: 24704)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "d_t_fmt", scope: !259, file: !181, line: 301, baseType: !29, size: 64, offset: 24768)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "d_fmt", scope: !259, file: !181, line: 302, baseType: !29, size: 64, offset: 24832)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt", scope: !259, file: !181, line: 303, baseType: !29, size: 64, offset: 24896)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "t_fmt_ampm", scope: !259, file: !181, line: 304, baseType: !29, size: 64, offset: 24960)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "era", scope: !259, file: !181, line: 305, baseType: !29, size: 64, offset: 25024)
!399 = !DIDerivedType(tag: DW_TAG_member, name: "era_year", scope: !259, file: !181, line: 307, baseType: !29, size: 64, offset: 25088)
!400 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_fmt", scope: !259, file: !181, line: 308, baseType: !29, size: 64, offset: 25152)
!401 = !DIDerivedType(tag: DW_TAG_member, name: "alt_digits", scope: !259, file: !181, line: 309, baseType: !29, size: 64, offset: 25216)
!402 = !DIDerivedType(tag: DW_TAG_member, name: "era_d_t_fmt", scope: !259, file: !181, line: 310, baseType: !29, size: 64, offset: 25280)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "era_t_fmt", scope: !259, file: !181, line: 311, baseType: !29, size: 64, offset: 25344)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "yesexpr", scope: !259, file: !181, line: 316, baseType: !29, size: 64, offset: 25408)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "noexpr", scope: !259, file: !181, line: 317, baseType: !29, size: 64, offset: 25472)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "yesstr", scope: !259, file: !181, line: 318, baseType: !29, size: 64, offset: 25536)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "nostr", scope: !259, file: !181, line: 319, baseType: !29, size: 64, offset: 25600)
!408 = !DIDerivedType(tag: DW_TAG_member, name: "collate", scope: !259, file: !181, line: 322, baseType: !409, size: 896, offset: 25664)
!409 = !DIDerivedType(tag: DW_TAG_typedef, name: "__collate_t", file: !181, line: 149, baseType: !410)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !181, line: 111, size: 896, elements: !411)
!411 = !{!412, !413, !414, !415, !416, !417, !418, !419, !420, !421, !422, !423, !424, !425, !426, !427, !428, !429, !430, !431, !432, !433, !434, !435, !437, !438}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "num_weights", scope: !410, file: !181, line: 112, baseType: !207, size: 16)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "num_starters", scope: !410, file: !181, line: 113, baseType: !207, size: 16, offset: 16)
!414 = !DIDerivedType(tag: DW_TAG_member, name: "ii_shift", scope: !410, file: !181, line: 114, baseType: !207, size: 16, offset: 32)
!415 = !DIDerivedType(tag: DW_TAG_member, name: "ti_shift", scope: !410, file: !181, line: 115, baseType: !207, size: 16, offset: 48)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "ii_len", scope: !410, file: !181, line: 116, baseType: !207, size: 16, offset: 64)
!417 = !DIDerivedType(tag: DW_TAG_member, name: "ti_len", scope: !410, file: !181, line: 117, baseType: !207, size: 16, offset: 80)
!418 = !DIDerivedType(tag: DW_TAG_member, name: "max_weight", scope: !410, file: !181, line: 118, baseType: !207, size: 16, offset: 96)
!419 = !DIDerivedType(tag: DW_TAG_member, name: "num_col_base", scope: !410, file: !181, line: 119, baseType: !207, size: 16, offset: 112)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "max_col_index", scope: !410, file: !181, line: 120, baseType: !207, size: 16, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "undefined_idx", scope: !410, file: !181, line: 121, baseType: !207, size: 16, offset: 144)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "range_low", scope: !410, file: !181, line: 122, baseType: !207, size: 16, offset: 160)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "range_count", scope: !410, file: !181, line: 123, baseType: !207, size: 16, offset: 176)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "range_base_weight", scope: !410, file: !181, line: 124, baseType: !207, size: 16, offset: 192)
!425 = !DIDerivedType(tag: DW_TAG_member, name: "range_rule_offset", scope: !410, file: !181, line: 125, baseType: !207, size: 16, offset: 208)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ii_mask", scope: !410, file: !181, line: 127, baseType: !207, size: 16, offset: 224)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ti_mask", scope: !410, file: !181, line: 128, baseType: !207, size: 16, offset: 240)
!428 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight_tbl", scope: !410, file: !181, line: 130, baseType: !205, size: 64, offset: 256)
!429 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx_tbl", scope: !410, file: !181, line: 131, baseType: !205, size: 64, offset: 320)
!430 = !DIDerivedType(tag: DW_TAG_member, name: "multistart_tbl", scope: !410, file: !181, line: 132, baseType: !205, size: 64, offset: 384)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "wcs2colidt_tbl", scope: !410, file: !181, line: 135, baseType: !205, size: 64, offset: 448)
!432 = !DIDerivedType(tag: DW_TAG_member, name: "overrides_tbl", scope: !410, file: !181, line: 138, baseType: !205, size: 64, offset: 512)
!433 = !DIDerivedType(tag: DW_TAG_member, name: "weightstr", scope: !410, file: !181, line: 141, baseType: !205, size: 64, offset: 576)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "ruletable", scope: !410, file: !181, line: 142, baseType: !205, size: 64, offset: 640)
!435 = !DIDerivedType(tag: DW_TAG_member, name: "index2weight", scope: !410, file: !181, line: 145, baseType: !436, size: 64, offset: 704)
!436 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !207, size: 64)
!437 = !DIDerivedType(tag: DW_TAG_member, name: "index2ruleidx", scope: !410, file: !181, line: 146, baseType: !436, size: 64, offset: 768)
!438 = !DIDerivedType(tag: DW_TAG_member, name: "MAX_WEIGHTS", scope: !410, file: !181, line: 148, baseType: !207, size: 16, offset: 832)
!439 = !DIGlobalVariableExpression(var: !440, expr: !DIExpression())
!440 = distinct !DIGlobalVariable(name: "__curlocale_var", scope: !177, file: !212, line: 380, type: !257, isLocal: false, isDefinition: true)
!441 = !DIGlobalVariableExpression(var: !442, expr: !DIExpression())
!442 = distinct !DIGlobalVariable(name: "utf8", scope: !177, file: !212, line: 387, type: !443, isLocal: true, isDefinition: true)
!443 = !DICompositeType(tag: DW_TAG_array_type, baseType: !30, size: 48, elements: !288)
!444 = !DIGlobalVariableExpression(var: !445, expr: !DIExpression())
!445 = distinct !DIGlobalVariable(name: "ascii", scope: !177, file: !212, line: 388, type: !443, isLocal: true, isDefinition: true)
!446 = !DIGlobalVariableExpression(var: !447, expr: !DIExpression())
!447 = distinct !DIGlobalVariable(name: "__code2flag", scope: !177, file: !212, line: 854, type: !448, isLocal: true, isDefinition: true)
!448 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 256, elements: !449)
!449 = !{!450}
!450 = !DISubrange(count: 16)
!451 = !DIDerivedType(tag: DW_TAG_typedef, name: "__uclibc_locale_t", file: !181, line: 324, baseType: !259)
!452 = !DIGlobalVariableExpression(var: !453, expr: !DIExpression())
!453 = distinct !DIGlobalVariable(name: "_stdio_streams", scope: !454, file: !455, line: 131, type: !499, isLocal: true, isDefinition: true)
!454 = distinct !DICompileUnit(language: DW_LANG_C99, file: !455, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !456, splitDebugInlining: false, nameTableKind: None)
!455 = !DIFile(filename: "libc/stdio/_stdio.c", directory: "/home/vondrp/klee/klee-uclibc")
!456 = !{!457, !489, !491, !493, !495, !497, !452}
!457 = !DIGlobalVariableExpression(var: !458, expr: !DIExpression())
!458 = distinct !DIGlobalVariable(name: "stdin", scope: !454, file: !455, line: 154, type: !459, isLocal: false, isDefinition: true)
!459 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !460, size: 64)
!460 = !DIDerivedType(tag: DW_TAG_typedef, name: "FILE", file: !461, line: 46, baseType: !462)
!461 = !DIFile(filename: "./include/stdio.h", directory: "/home/vondrp/klee/klee-uclibc")
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "__STDIO_FILE_STRUCT", file: !463, line: 233, size: 704, elements: !464)
!463 = !DIFile(filename: "./include/bits/uClibc_stdio.h", directory: "/home/vondrp/klee/klee-uclibc")
!464 = !{!465, !466, !470, !471, !472, !473, !474, !475, !476, !477, !479, !481, !488}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__modeflags", scope: !462, file: !463, line: 234, baseType: !98, size: 16)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot_width", scope: !462, file: !463, line: 237, baseType: !467, size: 16, offset: 16)
!467 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 16, elements: !468)
!468 = !{!469}
!469 = !DISubrange(count: 2)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__filedes", scope: !462, file: !463, line: 244, baseType: !45, size: 32, offset: 32)
!471 = !DIDerivedType(tag: DW_TAG_member, name: "__bufstart", scope: !462, file: !463, line: 246, baseType: !209, size: 64, offset: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "__bufend", scope: !462, file: !463, line: 247, baseType: !209, size: 64, offset: 128)
!473 = !DIDerivedType(tag: DW_TAG_member, name: "__bufpos", scope: !462, file: !463, line: 248, baseType: !209, size: 64, offset: 192)
!474 = !DIDerivedType(tag: DW_TAG_member, name: "__bufread", scope: !462, file: !463, line: 249, baseType: !209, size: 64, offset: 256)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "__bufgetc_u", scope: !462, file: !463, line: 252, baseType: !209, size: 64, offset: 320)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "__bufputc_u", scope: !462, file: !463, line: 255, baseType: !209, size: 64, offset: 384)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "__nextopen", scope: !462, file: !463, line: 261, baseType: !478, size: 64, offset: 448)
!478 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !462, size: 64)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "__ungot", scope: !462, file: !463, line: 268, baseType: !480, size: 64, offset: 512)
!480 = !DICompositeType(tag: DW_TAG_array_type, baseType: !314, size: 64, elements: !468)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "__state", scope: !462, file: !463, line: 271, baseType: !482, size: 64, offset: 576)
!482 = !DIDerivedType(tag: DW_TAG_typedef, name: "__mbstate_t", file: !483, line: 85, baseType: !484)
!483 = !DIFile(filename: "./include/wchar.h", directory: "/home/vondrp/klee/klee-uclibc")
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !483, line: 81, size: 64, elements: !485)
!485 = !{!486, !487}
!486 = !DIDerivedType(tag: DW_TAG_member, name: "__mask", scope: !484, file: !483, line: 83, baseType: !314, size: 32)
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__wc", scope: !484, file: !483, line: 84, baseType: !314, size: 32, offset: 32)
!488 = !DIDerivedType(tag: DW_TAG_member, name: "__unused", scope: !462, file: !463, line: 274, baseType: !6, size: 64, offset: 640)
!489 = !DIGlobalVariableExpression(var: !490, expr: !DIExpression())
!490 = distinct !DIGlobalVariable(name: "stdout", scope: !454, file: !455, line: 155, type: !459, isLocal: false, isDefinition: true)
!491 = !DIGlobalVariableExpression(var: !492, expr: !DIExpression())
!492 = distinct !DIGlobalVariable(name: "stderr", scope: !454, file: !455, line: 156, type: !459, isLocal: false, isDefinition: true)
!493 = !DIGlobalVariableExpression(var: !494, expr: !DIExpression())
!494 = distinct !DIGlobalVariable(name: "__stdin", scope: !454, file: !455, line: 159, type: !459, isLocal: false, isDefinition: true)
!495 = !DIGlobalVariableExpression(var: !496, expr: !DIExpression())
!496 = distinct !DIGlobalVariable(name: "__stdout", scope: !454, file: !455, line: 162, type: !459, isLocal: false, isDefinition: true)
!497 = !DIGlobalVariableExpression(var: !498, expr: !DIExpression())
!498 = distinct !DIGlobalVariable(name: "_stdio_openlist", scope: !454, file: !455, line: 180, type: !459, isLocal: false, isDefinition: true)
!499 = !DICompositeType(tag: DW_TAG_array_type, baseType: !460, size: 2112, elements: !141)
!500 = !DIGlobalVariableExpression(var: !501, expr: !DIExpression())
!501 = distinct !DIGlobalVariable(name: "__exe_env", scope: !502, file: !507, line: 34, type: !555, isLocal: false, isDefinition: true)
!502 = distinct !DICompileUnit(language: DW_LANG_C89, file: !503, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !504, splitDebugInlining: false, nameTableKind: None)
!503 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/fd_init.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!504 = !{!500, !505}
!505 = !DIGlobalVariableExpression(var: !506, expr: !DIExpression())
!506 = distinct !DIGlobalVariable(name: "__exe_fs", scope: !502, file: !507, line: 21, type: !508, isLocal: false, isDefinition: true)
!507 = !DIFile(filename: "runtime/POSIX/fd_init.c", directory: "/home/vondrp/klee/klee")
!508 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_system_t", file: !68, line: 86, baseType: !509)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 74, size: 832, elements: !510)
!510 = !{!511, !512, !543, !544, !545, !546, !547, !549, !550, !551, !552, !553, !554}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "n_sym_files", scope: !509, file: !68, line: 75, baseType: !69, size: 32)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdin", scope: !509, file: !68, line: 76, baseType: !513, size: 64, offset: 64)
!513 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !514, size: 64)
!514 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_disk_file_t", file: !68, line: 56, baseType: !515)
!515 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 52, size: 192, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !515, file: !68, line: 53, baseType: !69, size: 32)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "contents", scope: !515, file: !68, line: 54, baseType: !7, size: 64, offset: 64)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "stat", scope: !515, file: !68, line: 55, baseType: !520, size: 64, offset: 128)
!520 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !521, size: 64)
!521 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !107, line: 103, size: 1152, elements: !522)
!522 = !{!523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !535, !540, !541, !542}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !521, file: !107, line: 108, baseType: !110, size: 64)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !521, file: !107, line: 110, baseType: !95, size: 64, offset: 64)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !521, file: !107, line: 111, baseType: !114, size: 64, offset: 128)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !521, file: !107, line: 112, baseType: !116, size: 32, offset: 192)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !521, file: !107, line: 119, baseType: !118, size: 32, offset: 224)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !521, file: !107, line: 120, baseType: !120, size: 32, offset: 256)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !521, file: !107, line: 122, baseType: !45, size: 32, offset: 288)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !521, file: !107, line: 123, baseType: !110, size: 64, offset: 320)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !521, file: !107, line: 124, baseType: !124, size: 64, offset: 384)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !521, file: !107, line: 130, baseType: !126, size: 64, offset: 448)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !521, file: !107, line: 131, baseType: !534, size: 64, offset: 512)
!534 = !DIDerivedType(tag: DW_TAG_typedef, name: "__blkcnt64_t", file: !60, line: 181, baseType: !61)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !521, file: !107, line: 139, baseType: !536, size: 128, offset: 576)
!536 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !131, line: 11, size: 128, elements: !537)
!537 = !{!538, !539}
!538 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !536, file: !131, line: 16, baseType: !134, size: 64)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !536, file: !131, line: 21, baseType: !136, size: 64, offset: 64)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !521, file: !107, line: 140, baseType: !536, size: 128, offset: 704)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !521, file: !107, line: 141, baseType: !536, size: 128, offset: 832)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !521, file: !107, line: 151, baseType: !140, size: 192, offset: 960)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "sym_stdout", scope: !509, file: !68, line: 76, baseType: !513, size: 64, offset: 128)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "stdout_writes", scope: !509, file: !68, line: 77, baseType: !69, size: 32, offset: 192)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "sym_files", scope: !509, file: !68, line: 78, baseType: !513, size: 64, offset: 256)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "max_failures", scope: !509, file: !68, line: 81, baseType: !69, size: 32, offset: 320)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "read_fail", scope: !509, file: !68, line: 84, baseType: !548, size: 64, offset: 384)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "write_fail", scope: !509, file: !68, line: 84, baseType: !548, size: 64, offset: 448)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "close_fail", scope: !509, file: !68, line: 84, baseType: !548, size: 64, offset: 512)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "ftruncate_fail", scope: !509, file: !68, line: 84, baseType: !548, size: 64, offset: 576)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "getcwd_fail", scope: !509, file: !68, line: 84, baseType: !548, size: 64, offset: 640)
!553 = !DIDerivedType(tag: DW_TAG_member, name: "chmod_fail", scope: !509, file: !68, line: 85, baseType: !548, size: 64, offset: 704)
!554 = !DIDerivedType(tag: DW_TAG_member, name: "fchmod_fail", scope: !509, file: !68, line: 85, baseType: !548, size: 64, offset: 768)
!555 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_sym_env_t", file: !68, line: 100, baseType: !556)
!556 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 93, size: 6208, elements: !557)
!557 = !{!558, !569, !570}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "fds", scope: !556, file: !68, line: 94, baseType: !559, size: 6144)
!559 = !DICompositeType(tag: DW_TAG_array_type, baseType: !560, size: 6144, elements: !567)
!560 = !DIDerivedType(tag: DW_TAG_typedef, name: "exe_file_t", file: !68, line: 72, baseType: !561)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !68, line: 65, size: 192, elements: !562)
!562 = !{!563, !564, !565, !566}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !561, file: !68, line: 66, baseType: !45, size: 32)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !561, file: !68, line: 67, baseType: !69, size: 32, offset: 32)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "off", scope: !561, file: !68, line: 70, baseType: !88, size: 64, offset: 64)
!566 = !DIDerivedType(tag: DW_TAG_member, name: "dfile", scope: !561, file: !68, line: 71, baseType: !513, size: 64, offset: 128)
!567 = !{!568}
!568 = !DISubrange(count: 32)
!569 = !DIDerivedType(tag: DW_TAG_member, name: "umask", scope: !556, file: !68, line: 95, baseType: !159, size: 32, offset: 6144)
!570 = !DIDerivedType(tag: DW_TAG_member, name: "save_all_writes", scope: !556, file: !68, line: 99, baseType: !45, size: 32, offset: 6176)
!571 = !DIGlobalVariableExpression(var: !572, expr: !DIExpression())
!572 = distinct !DIGlobalVariable(name: "locale_mmap", scope: !573, file: !574, line: 11, type: !579, isLocal: true, isDefinition: true)
!573 = distinct !DICompileUnit(language: DW_LANG_C99, file: !574, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !575, splitDebugInlining: false, nameTableKind: None)
!574 = !DIFile(filename: "extra/locale/locale_data.c", directory: "/home/vondrp/klee/klee-uclibc")
!575 = !{!576, !571}
!576 = !DIGlobalVariableExpression(var: !577, expr: !DIExpression())
!577 = distinct !DIGlobalVariable(name: "__locale_mmap", scope: !573, file: !574, line: 20149, type: !578, isLocal: false, isDefinition: true)
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !579, size: 64)
!579 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !580)
!580 = !DIDerivedType(tag: DW_TAG_typedef, name: "__locale_mmap_t", file: !581, line: 91, baseType: !582)
!581 = !DIFile(filename: "./extra/locale/locale_mmap.h", directory: "/home/vondrp/klee/klee-uclibc")
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !581, line: 31, size: 2047232, elements: !583)
!583 = !{!584, !588, !592, !596, !600, !604, !608, !612, !616, !620, !624, !628, !632, !649, !653, !655, !657, !661, !663, !667, !671, !675, !679, !683, !687, !691, !695, !699, !703, !707, !708, !712, !716, !720, !724, !728}
!584 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8ctype", scope: !582, file: !581, line: 37, baseType: !585, size: 3360)
!585 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 3360, elements: !586)
!586 = !{!587}
!587 = !DISubrange(count: 420)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8uplow", scope: !582, file: !581, line: 38, baseType: !589, size: 4032, offset: 3360)
!589 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 4032, elements: !590)
!590 = !{!591}
!591 = !DISubrange(count: 504)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8c2wc", scope: !582, file: !581, line: 40, baseType: !593, size: 28160, offset: 7392)
!593 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 28160, elements: !594)
!594 = !{!595}
!595 = !DISubrange(count: 1760)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "tbl8wc2c", scope: !582, file: !581, line: 41, baseType: !597, size: 36224, offset: 35552)
!597 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 36224, elements: !598)
!598 = !{!599}
!599 = !DISubrange(count: 4528)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "tblwctype", scope: !582, file: !581, line: 46, baseType: !601, size: 28832, offset: 71776)
!601 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 28832, elements: !602)
!602 = !{!603}
!603 = !DISubrange(count: 3604)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow", scope: !582, file: !581, line: 47, baseType: !605, size: 13440, offset: 100608)
!605 = !DICompositeType(tag: DW_TAG_array_type, baseType: !204, size: 13440, elements: !606)
!606 = !{!607}
!607 = !DISubrange(count: 1680)
!608 = !DIDerivedType(tag: DW_TAG_member, name: "tblwuplow_diff", scope: !582, file: !581, line: 48, baseType: !609, size: 3136, offset: 114048)
!609 = !DICompositeType(tag: DW_TAG_array_type, baseType: !311, size: 3136, elements: !610)
!610 = !{!611}
!611 = !DISubrange(count: 196)
!612 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_data", scope: !582, file: !581, line: 53, baseType: !613, size: 408, offset: 117184)
!613 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 408, elements: !614)
!614 = !{!615}
!615 = !DISubrange(count: 51)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_data", scope: !582, file: !581, line: 54, baseType: !617, size: 224, offset: 117592)
!617 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 224, elements: !618)
!618 = !{!619}
!619 = !DISubrange(count: 28)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_data", scope: !582, file: !581, line: 55, baseType: !621, size: 13168, offset: 117816)
!621 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 13168, elements: !622)
!622 = !{!623}
!623 = !DISubrange(count: 1646)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_data", scope: !582, file: !581, line: 56, baseType: !625, size: 226824, offset: 130984)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 226824, elements: !626)
!626 = !{!627}
!627 = !DISubrange(count: 28353)
!628 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_data", scope: !582, file: !581, line: 58, baseType: !629, size: 14432, offset: 357808)
!629 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 14432, elements: !630)
!630 = !{!631}
!631 = !DISubrange(count: 1804)
!632 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_8_bit", scope: !582, file: !581, line: 62, baseType: !633, size: 15824, offset: 372240)
!633 = !DICompositeType(tag: DW_TAG_array_type, baseType: !634, size: 15824, elements: !647)
!634 = !DIDerivedType(tag: DW_TAG_const_type, baseType: !635)
!635 = !DIDerivedType(tag: DW_TAG_typedef, name: "__codeset_8_bit_t", file: !636, line: 21, baseType: !637)
!636 = !DIFile(filename: "./extra/locale/c8tables.h", directory: "/home/vondrp/klee/klee-uclibc")
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !636, line: 16, size: 688, elements: !638)
!638 = !{!639, !641, !642, !643}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "idx8ctype", scope: !637, file: !636, line: 17, baseType: !640, size: 128)
!640 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 128, elements: !449)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "idx8uplow", scope: !637, file: !636, line: 18, baseType: !640, size: 128, offset: 128)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "idx8c2wc", scope: !637, file: !636, line: 19, baseType: !640, size: 128, offset: 256)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "idx8wc2c", scope: !637, file: !636, line: 20, baseType: !644, size: 304, offset: 384)
!644 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 304, elements: !645)
!645 = !{!646}
!646 = !DISubrange(count: 38)
!647 = !{!648}
!648 = !DISubrange(count: 23)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_rows", scope: !582, file: !581, line: 65, baseType: !650, size: 160, offset: 388064)
!650 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 160, elements: !651)
!651 = !{!652}
!652 = !DISubrange(count: 20)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_offsets", scope: !582, file: !581, line: 65, baseType: !654, size: 160, offset: 388224)
!654 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 160, elements: !296)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "lc_ctype_item_idx", scope: !582, file: !581, line: 65, baseType: !656, size: 320, offset: 388384)
!656 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 320, elements: !651)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_rows", scope: !582, file: !581, line: 66, baseType: !658, size: 360, offset: 388704)
!658 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 360, elements: !659)
!659 = !{!660}
!660 = !DISubrange(count: 45)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_offsets", scope: !582, file: !581, line: 66, baseType: !662, size: 48, offset: 389072)
!662 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 48, elements: !141)
!663 = !DIDerivedType(tag: DW_TAG_member, name: "lc_numeric_item_idx", scope: !582, file: !581, line: 66, baseType: !664, size: 240, offset: 389120)
!664 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 240, elements: !665)
!665 = !{!666}
!666 = !DISubrange(count: 15)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_rows", scope: !582, file: !581, line: 67, baseType: !668, size: 31152, offset: 389360)
!668 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 31152, elements: !669)
!669 = !{!670}
!670 = !DISubrange(count: 3894)
!671 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_offsets", scope: !582, file: !581, line: 67, baseType: !672, size: 352, offset: 420512)
!672 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 352, elements: !673)
!673 = !{!674}
!674 = !DISubrange(count: 22)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "lc_monetary_item_idx", scope: !582, file: !581, line: 67, baseType: !676, size: 6512, offset: 420864)
!676 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 6512, elements: !677)
!677 = !{!678}
!678 = !DISubrange(count: 407)
!679 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_rows", scope: !582, file: !581, line: 68, baseType: !680, size: 66000, offset: 427376)
!680 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 66000, elements: !681)
!681 = !{!682}
!682 = !DISubrange(count: 8250)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_offsets", scope: !582, file: !581, line: 68, baseType: !684, size: 800, offset: 493376)
!684 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 800, elements: !685)
!685 = !{!686}
!686 = !DISubrange(count: 50)
!687 = !DIDerivedType(tag: DW_TAG_member, name: "lc_time_item_idx", scope: !582, file: !581, line: 68, baseType: !688, size: 54864, offset: 494176)
!688 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 54864, elements: !689)
!689 = !{!690}
!690 = !DISubrange(count: 3429)
!691 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_rows", scope: !582, file: !581, line: 70, baseType: !692, size: 2976, offset: 549040)
!692 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2976, elements: !693)
!693 = !{!694}
!694 = !DISubrange(count: 372)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_offsets", scope: !582, file: !581, line: 70, baseType: !696, size: 64, offset: 552016)
!696 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 64, elements: !697)
!697 = !{!698}
!698 = !DISubrange(count: 4)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "lc_messages_item_idx", scope: !582, file: !581, line: 70, baseType: !700, size: 3200, offset: 552080)
!700 = !DICompositeType(tag: DW_TAG_array_type, baseType: !207, size: 3200, elements: !701)
!701 = !{!702}
!702 = !DISubrange(count: 200)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "collate_data", scope: !582, file: !581, line: 72, baseType: !704, size: 1458256, offset: 555280)
!704 = !DICompositeType(tag: DW_TAG_array_type, baseType: !206, size: 1458256, elements: !705)
!705 = !{!706}
!706 = !DISubrange(count: 91141)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_item_offsets_LEN", scope: !582, file: !581, line: 74, baseType: !291, size: 48, offset: 2013536)
!708 = !DIDerivedType(tag: DW_TAG_member, name: "lc_common_tbl_offsets", scope: !582, file: !581, line: 75, baseType: !709, size: 1536, offset: 2013632)
!709 = !DICompositeType(tag: DW_TAG_array_type, baseType: !23, size: 1536, elements: !710)
!710 = !{!711}
!711 = !DISubrange(count: 24)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "locales", scope: !582, file: !581, line: 80, baseType: !713, size: 22608, offset: 2015168)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 22608, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 2826)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "locale_names5", scope: !582, file: !581, line: 81, baseType: !717, size: 6680, offset: 2037776)
!717 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 6680, elements: !718)
!718 = !{!719}
!719 = !DISubrange(count: 835)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "locale_at_modifiers", scope: !582, file: !581, line: 82, baseType: !721, size: 144, offset: 2044456)
!721 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 144, elements: !722)
!722 = !{!723}
!723 = !DISubrange(count: 18)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "lc_names", scope: !582, file: !581, line: 85, baseType: !725, size: 552, offset: 2044600)
!725 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 552, elements: !726)
!726 = !{!727}
!727 = !DISubrange(count: 69)
!728 = !DIDerivedType(tag: DW_TAG_member, name: "codeset_list", scope: !582, file: !581, line: 87, baseType: !729, size: 2040, offset: 2045152)
!729 = !DICompositeType(tag: DW_TAG_array_type, baseType: !100, size: 2040, elements: !730)
!730 = !{!731}
!731 = !DISubrange(count: 255)
!732 = !DIGlobalVariableExpression(var: !733, expr: !DIExpression())
!733 = distinct !DIGlobalVariable(name: "__C_ctype_b_data", scope: !734, file: !739, line: 471, type: !740, isLocal: false, isDefinition: true)
!734 = distinct !DICompileUnit(language: DW_LANG_C99, file: !735, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !736, splitDebugInlining: false, nameTableKind: None)
!735 = !DIFile(filename: "libc/misc/ctype/__C_ctype_b.c", directory: "/home/vondrp/klee/klee-uclibc")
!736 = !{!732, !737}
!737 = !DIGlobalVariableExpression(var: !738, expr: !DIExpression())
!738 = distinct !DIGlobalVariable(name: "__C_ctype_b", scope: !734, file: !739, line: 862, type: !262, isLocal: false, isDefinition: true)
!739 = !DIFile(filename: "libc/misc/ctype/ctype.c", directory: "/home/vondrp/klee/klee-uclibc")
!740 = !DICompositeType(tag: DW_TAG_array_type, baseType: !263, size: 6144, elements: !277)
!741 = !DIGlobalVariableExpression(var: !742, expr: !DIExpression())
!742 = distinct !DIGlobalVariable(name: "__C_ctype_tolower_data", scope: !743, file: !739, line: 878, type: !748, isLocal: false, isDefinition: true)
!743 = distinct !DICompileUnit(language: DW_LANG_C99, file: !744, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !745, splitDebugInlining: false, nameTableKind: None)
!744 = !DIFile(filename: "libc/misc/ctype/__C_ctype_tolower.c", directory: "/home/vondrp/klee/klee-uclibc")
!745 = !{!741, !746}
!746 = !DIGlobalVariableExpression(var: !747, expr: !DIExpression())
!747 = distinct !DIGlobalVariable(name: "__C_ctype_tolower", scope: !743, file: !739, line: 981, type: !269, isLocal: false, isDefinition: true)
!748 = !DICompositeType(tag: DW_TAG_array_type, baseType: !270, size: 6144, elements: !277)
!749 = !DIGlobalVariableExpression(var: !750, expr: !DIExpression())
!750 = distinct !DIGlobalVariable(name: "__C_ctype_toupper_data", scope: !751, file: !739, line: 1000, type: !748, isLocal: false, isDefinition: true)
!751 = distinct !DICompileUnit(language: DW_LANG_C99, file: !752, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !753, splitDebugInlining: false, nameTableKind: None)
!752 = !DIFile(filename: "libc/misc/ctype/__C_ctype_toupper.c", directory: "/home/vondrp/klee/klee-uclibc")
!753 = !{!749, !754}
!754 = !DIGlobalVariableExpression(var: !755, expr: !DIExpression())
!755 = distinct !DIGlobalVariable(name: "__C_ctype_toupper", scope: !751, file: !739, line: 1103, type: !269, isLocal: false, isDefinition: true)
!756 = !DIGlobalVariableExpression(var: !757, expr: !DIExpression())
!757 = distinct !DIGlobalVariable(name: "errno", scope: !758, file: !759, line: 7, type: !45, isLocal: false, isDefinition: true)
!758 = distinct !DICompileUnit(language: DW_LANG_C99, file: !759, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !760, splitDebugInlining: false, nameTableKind: None)
!759 = !DIFile(filename: "libc/misc/internals/errno.c", directory: "/home/vondrp/klee/klee-uclibc")
!760 = !{!756, !761}
!761 = !DIGlobalVariableExpression(var: !762, expr: !DIExpression())
!762 = distinct !DIGlobalVariable(name: "h_errno", scope: !758, file: !759, line: 8, type: !45, isLocal: false, isDefinition: true)
!763 = distinct !DICompileUnit(language: DW_LANG_C89, file: !764, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !765, splitDebugInlining: false, nameTableKind: None)
!764 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/fd_32.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!765 = !{!766, !767, !7, !775, !23}
!766 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !58, line: 85, baseType: !124)
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !768, size: 64)
!768 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !92, line: 37, size: 2240, elements: !769)
!769 = !{!770, !771, !772, !773, !774}
!770 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !768, file: !92, line: 39, baseType: !95, size: 64)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !768, file: !92, line: 40, baseType: !89, size: 64, offset: 64)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !768, file: !92, line: 41, baseType: !98, size: 16, offset: 128)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !768, file: !92, line: 42, baseType: !100, size: 8, offset: 144)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !768, file: !92, line: 43, baseType: !102, size: 2048, offset: 152)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !776, size: 64)
!776 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent", file: !92, line: 22, size: 2240, elements: !777)
!777 = !{!778, !779, !780, !781, !782}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !776, file: !92, line: 25, baseType: !112, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !776, file: !92, line: 26, baseType: !124, size: 64, offset: 64)
!780 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !776, file: !92, line: 31, baseType: !98, size: 16, offset: 128)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !776, file: !92, line: 32, baseType: !100, size: 8, offset: 144)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !776, file: !92, line: 33, baseType: !102, size: 2048, offset: 152)
!783 = distinct !DICompileUnit(language: DW_LANG_C89, file: !784, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !785, splitDebugInlining: false, nameTableKind: None)
!784 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/klee_init_env.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!785 = !{!37}
!786 = distinct !DICompileUnit(language: DW_LANG_C99, file: !787, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!787 = !DIFile(filename: "libc/misc/internals/__errno_location.c", directory: "/home/vondrp/klee/klee-uclibc")
!788 = distinct !DICompileUnit(language: DW_LANG_C99, file: !789, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!789 = !DIFile(filename: "libc/misc/internals/__h_errno_location.c", directory: "/home/vondrp/klee/klee-uclibc")
!790 = distinct !DICompileUnit(language: DW_LANG_C99, file: !791, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !792, globals: !806, splitDebugInlining: false, nameTableKind: None)
!791 = !DIFile(filename: "libc/stdlib/abort.c", directory: "/home/vondrp/klee/klee-uclibc")
!792 = !{!793, !6, !802}
!793 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !794, size: 64)
!794 = !DIDerivedType(tag: DW_TAG_typedef, name: "sigset_t", file: !795, line: 50, baseType: !796)
!795 = !DIFile(filename: "./include/signal.h", directory: "/home/vondrp/klee/klee-uclibc")
!796 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sigset_t", file: !797, line: 31, baseType: !798)
!797 = !DIFile(filename: "./include/bits/sigset.h", directory: "/home/vondrp/klee/klee-uclibc")
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, file: !797, line: 28, size: 1024, elements: !799)
!799 = !{!800}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "__val", scope: !798, file: !797, line: 30, baseType: !801, size: 1024)
!801 = !DICompositeType(tag: DW_TAG_array_type, baseType: !10, size: 1024, elements: !449)
!802 = !DIDerivedType(tag: DW_TAG_typedef, name: "__sighandler_t", file: !795, line: 75, baseType: !803)
!803 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !804, size: 64)
!804 = !DISubroutineType(types: !805)
!805 = !{null, !45}
!806 = !{!807}
!807 = !DIGlobalVariableExpression(var: !808, expr: !DIExpression())
!808 = distinct !DIGlobalVariable(name: "been_there_done_that", scope: !790, file: !791, line: 49, type: !45, isLocal: true, isDefinition: true)
!809 = distinct !DICompileUnit(language: DW_LANG_C99, file: !810, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, globals: !811, splitDebugInlining: false, nameTableKind: None)
!810 = !DIFile(filename: "libc/stdlib/exit.c", directory: "/home/vondrp/klee/klee-uclibc")
!811 = !{!812}
!812 = !DIGlobalVariableExpression(var: !813, expr: !DIExpression())
!813 = distinct !DIGlobalVariable(name: "__exit_cleanup", scope: !809, file: !814, line: 309, type: !803, isLocal: false, isDefinition: true)
!814 = !DIFile(filename: "libc/stdlib/_atexit.c", directory: "/home/vondrp/klee/klee-uclibc")
!815 = distinct !DICompileUnit(language: DW_LANG_C99, file: !816, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!816 = !DIFile(filename: "libc/string/memcpy.c", directory: "/home/vondrp/klee/klee-uclibc")
!817 = distinct !DICompileUnit(language: DW_LANG_C99, file: !818, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !819, splitDebugInlining: false, nameTableKind: None)
!818 = !DIFile(filename: "libc/string/memset.c", directory: "/home/vondrp/klee/klee-uclibc")
!819 = !{!820, !821}
!820 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !821, size: 64)
!821 = !DIDerivedType(tag: DW_TAG_typedef, name: "__string_uchar_t", file: !822, line: 27, baseType: !100)
!822 = !DIFile(filename: "libc/string/_string.h", directory: "/home/vondrp/klee/klee-uclibc")
!823 = distinct !DICompileUnit(language: DW_LANG_C99, file: !824, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !825, splitDebugInlining: false, nameTableKind: None)
!824 = !DIFile(filename: "libc/string/strrchr.c", directory: "/home/vondrp/klee/klee-uclibc")
!825 = !{!8, !7}
!826 = distinct !DICompileUnit(language: DW_LANG_C99, file: !827, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!827 = !DIFile(filename: "tests/sort/generated_main_klee.c", directory: "/home/vondrp/programs/dip/profiler_tool")
!828 = distinct !DICompileUnit(language: DW_LANG_C99, file: !829, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!829 = !DIFile(filename: "tests/sort/sort.c", directory: "/home/vondrp/programs/dip/profiler_tool")
!830 = distinct !DICompileUnit(language: DW_LANG_C89, file: !831, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !832, retainedTypes: !839, splitDebugInlining: false, nameTableKind: None)
!831 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/stubs.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!832 = !{!833}
!833 = !DICompositeType(tag: DW_TAG_enumeration_type, file: !834, line: 74, baseType: !69, size: 32, elements: !835)
!834 = !DIFile(filename: "/usr/include/x86_64-linux-gnu/sys/wait.h", directory: "")
!835 = !{!836, !837, !838}
!836 = !DIEnumerator(name: "P_ALL", value: 0)
!837 = !DIEnumerator(name: "P_PID", value: 1)
!838 = !DIEnumerator(name: "P_PGID", value: 2)
!839 = !{!6, !840, !69, !843}
!840 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !841, size: 64)
!841 = !DICompositeType(tag: DW_TAG_structure_type, name: "utmpx", file: !842, line: 199, flags: DIFlagFwdDecl)
!842 = !DIFile(filename: "runtime/POSIX/stubs.c", directory: "/home/vondrp/klee/klee")
!843 = !DIDerivedType(tag: DW_TAG_typedef, name: "dev_t", file: !58, line: 59, baseType: !110)
!844 = distinct !DICompileUnit(language: DW_LANG_C99, file: !845, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !846, retainedTypes: !847, splitDebugInlining: false, nameTableKind: None)
!845 = !DIFile(filename: "libc/misc/locale/__locale_mbrtowc_l.c", directory: "/home/vondrp/klee/klee-uclibc")
!846 = !{!180}
!847 = !{!100}
!848 = distinct !DICompileUnit(language: DW_LANG_C99, file: !849, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!849 = !DIFile(filename: "libc/signal/raise.c", directory: "/home/vondrp/klee/klee-uclibc")
!850 = distinct !DICompileUnit(language: DW_LANG_C99, file: !851, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!851 = !DIFile(filename: "libc/signal/sigaction.c", directory: "/home/vondrp/klee/klee-uclibc")
!852 = distinct !DICompileUnit(language: DW_LANG_C99, file: !853, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !854, splitDebugInlining: false, nameTableKind: None)
!853 = !DIFile(filename: "libc/signal/sigsetops.c", directory: "/home/vondrp/klee/klee-uclibc")
!854 = !{!10}
!855 = distinct !DICompileUnit(language: DW_LANG_C99, file: !856, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!856 = !DIFile(filename: "libc/stdio/_wcommit.c", directory: "/home/vondrp/klee/klee-uclibc")
!857 = distinct !DICompileUnit(language: DW_LANG_C99, file: !858, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!858 = !DIFile(filename: "libc/string/strlen.c", directory: "/home/vondrp/klee/klee-uclibc")
!859 = distinct !DICompileUnit(language: DW_LANG_C99, file: !860, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !861, splitDebugInlining: false, nameTableKind: None)
!860 = !DIFile(filename: "libc/string/strncmp.c", directory: "/home/vondrp/klee/klee-uclibc")
!861 = !{!45, !209}
!862 = distinct !DICompileUnit(language: DW_LANG_C99, file: !863, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!863 = !DIFile(filename: "libc/termios/isatty.c", directory: "/home/vondrp/klee/klee-uclibc")
!864 = distinct !DICompileUnit(language: DW_LANG_C89, file: !865, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !866, splitDebugInlining: false, nameTableKind: None)
!865 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/Intrinsic/klee_range.c", directory: "/home/vondrp/klee/klee/build/runtime/Intrinsic")
!866 = !{!69}
!867 = distinct !DICompileUnit(language: DW_LANG_C89, file: !868, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !869, splitDebugInlining: false, nameTableKind: None)
!868 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/fd_64.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!869 = !{!870, !892}
!870 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !871, size: 64)
!871 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "stat64", file: !107, line: 103, size: 1152, elements: !872)
!872 = !{!873, !874, !875, !876, !877, !878, !879, !880, !881, !882, !883, !884, !889, !890, !891}
!873 = !DIDerivedType(tag: DW_TAG_member, name: "st_dev", scope: !871, file: !107, line: 108, baseType: !110, size: 64)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "st_ino", scope: !871, file: !107, line: 110, baseType: !95, size: 64, offset: 64)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "st_nlink", scope: !871, file: !107, line: 111, baseType: !114, size: 64, offset: 128)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "st_mode", scope: !871, file: !107, line: 112, baseType: !116, size: 32, offset: 192)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "st_uid", scope: !871, file: !107, line: 119, baseType: !118, size: 32, offset: 224)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "st_gid", scope: !871, file: !107, line: 120, baseType: !120, size: 32, offset: 256)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "__pad0", scope: !871, file: !107, line: 122, baseType: !45, size: 32, offset: 288)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "st_rdev", scope: !871, file: !107, line: 123, baseType: !110, size: 64, offset: 320)
!881 = !DIDerivedType(tag: DW_TAG_member, name: "st_size", scope: !871, file: !107, line: 124, baseType: !124, size: 64, offset: 384)
!882 = !DIDerivedType(tag: DW_TAG_member, name: "st_blksize", scope: !871, file: !107, line: 130, baseType: !126, size: 64, offset: 448)
!883 = !DIDerivedType(tag: DW_TAG_member, name: "st_blocks", scope: !871, file: !107, line: 131, baseType: !534, size: 64, offset: 512)
!884 = !DIDerivedType(tag: DW_TAG_member, name: "st_atim", scope: !871, file: !107, line: 139, baseType: !885, size: 128, offset: 576)
!885 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", file: !131, line: 11, size: 128, elements: !886)
!886 = !{!887, !888}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !885, file: !131, line: 16, baseType: !134, size: 64)
!888 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !885, file: !131, line: 21, baseType: !136, size: 64, offset: 64)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "st_mtim", scope: !871, file: !107, line: 140, baseType: !885, size: 128, offset: 704)
!890 = !DIDerivedType(tag: DW_TAG_member, name: "st_ctim", scope: !871, file: !107, line: 141, baseType: !885, size: 128, offset: 832)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "__glibc_reserved", scope: !871, file: !107, line: 151, baseType: !140, size: 192, offset: 960)
!892 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !893, size: 64)
!893 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dirent64", file: !92, line: 37, size: 2240, elements: !894)
!894 = !{!895, !896, !897, !898, !899}
!895 = !DIDerivedType(tag: DW_TAG_member, name: "d_ino", scope: !893, file: !92, line: 39, baseType: !95, size: 64)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "d_off", scope: !893, file: !92, line: 40, baseType: !89, size: 64, offset: 64)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "d_reclen", scope: !893, file: !92, line: 41, baseType: !98, size: 16, offset: 128)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "d_type", scope: !893, file: !92, line: 42, baseType: !100, size: 8, offset: 144)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "d_name", scope: !893, file: !92, line: 43, baseType: !102, size: 2048, offset: 152)
!900 = distinct !DICompileUnit(language: DW_LANG_C89, file: !901, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, splitDebugInlining: false, nameTableKind: None)
!901 = !DIFile(filename: "/home/vondrp/klee/klee/runtime/POSIX/illegal.c", directory: "/home/vondrp/klee/klee/build/runtime/POSIX")
!902 = distinct !DICompileUnit(language: DW_LANG_C99, file: !903, producer: "Ubuntu clang version 13.0.1-2ubuntu2.2", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !4, retainedTypes: !904, globals: !941, splitDebugInlining: false, nameTableKind: None)
!903 = !DIFile(filename: "libc/misc/utmp/utent.c", directory: "/home/vondrp/klee/klee-uclibc")
!904 = !{!6, !905, !908, !7}
!905 = !DIDerivedType(tag: DW_TAG_typedef, name: "off_t", file: !906, line: 88, baseType: !907)
!906 = !DIFile(filename: "./include/sys/types.h", directory: "/home/vondrp/klee/klee-uclibc")
!907 = !DIDerivedType(tag: DW_TAG_typedef, name: "__off_t", file: !267, line: 145, baseType: !61)
!908 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !909, size: 64)
!909 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "utmp", file: !910, line: 60, size: 3200, elements: !911)
!910 = !DIFile(filename: "./include/bits/utmp.h", directory: "/home/vondrp/klee/klee-uclibc")
!911 = !{!912, !913, !916, !918, !920, !921, !922, !927, !928, !936, !939}
!912 = !DIDerivedType(tag: DW_TAG_member, name: "ut_type", scope: !909, file: !910, line: 62, baseType: !273, size: 16)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "ut_pid", scope: !909, file: !910, line: 63, baseType: !914, size: 32, offset: 32)
!914 = !DIDerivedType(tag: DW_TAG_typedef, name: "pid_t", file: !906, line: 100, baseType: !915)
!915 = !DIDerivedType(tag: DW_TAG_typedef, name: "__pid_t", file: !267, line: 147, baseType: !45)
!916 = !DIDerivedType(tag: DW_TAG_member, name: "ut_line", scope: !909, file: !910, line: 64, baseType: !917, size: 256, offset: 64)
!917 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 256, elements: !567)
!918 = !DIDerivedType(tag: DW_TAG_member, name: "ut_id", scope: !909, file: !910, line: 65, baseType: !919, size: 32, offset: 320)
!919 = !DICompositeType(tag: DW_TAG_array_type, baseType: !8, size: 32, elements: !697)
!920 = !DIDerivedType(tag: DW_TAG_member, name: "ut_user", scope: !909, file: !910, line: 66, baseType: !917, size: 256, offset: 352)
!921 = !DIDerivedType(tag: DW_TAG_member, name: "ut_host", scope: !909, file: !910, line: 67, baseType: !102, size: 2048, offset: 608)
!922 = !DIDerivedType(tag: DW_TAG_member, name: "ut_exit", scope: !909, file: !910, line: 68, baseType: !923, size: 32, offset: 2656)
!923 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "exit_status", file: !910, line: 52, size: 32, elements: !924)
!924 = !{!925, !926}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "e_termination", scope: !923, file: !910, line: 54, baseType: !273, size: 16)
!926 = !DIDerivedType(tag: DW_TAG_member, name: "e_exit", scope: !923, file: !910, line: 55, baseType: !273, size: 16, offset: 16)
!927 = !DIDerivedType(tag: DW_TAG_member, name: "ut_session", scope: !909, file: !910, line: 81, baseType: !61, size: 64, offset: 2688)
!928 = !DIDerivedType(tag: DW_TAG_member, name: "ut_tv", scope: !909, file: !910, line: 82, baseType: !929, size: 128, offset: 2752)
!929 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", file: !930, line: 73, size: 128, elements: !931)
!930 = !DIFile(filename: "./include/bits/time.h", directory: "/home/vondrp/klee/klee-uclibc")
!931 = !{!932, !934}
!932 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !929, file: !930, line: 75, baseType: !933, size: 64)
!933 = !DIDerivedType(tag: DW_TAG_typedef, name: "__time_t", file: !267, line: 153, baseType: !61)
!934 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !929, file: !930, line: 76, baseType: !935, size: 64, offset: 64)
!935 = !DIDerivedType(tag: DW_TAG_typedef, name: "__suseconds_t", file: !267, line: 155, baseType: !61)
!936 = !DIDerivedType(tag: DW_TAG_member, name: "ut_addr_v6", scope: !909, file: !910, line: 85, baseType: !937, size: 128, offset: 2880)
